-- made by { @wounds1 } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] = "هلاوو99وووات نورت/ي ❤️🙈" 

ws[2] = "هلو" -- msg 
rs[2] = "😻هلاوات حبي 💟 نورت/ي 😇" -- reply 

ws[3] = "هلا" -- msg 
rs[3] = "😻هلاوات حبي 💟 نورت/ي 😇" -- reply 

ws[4] = "هلو" -- msg 
rs[4] = "😻هلاوات حبي 💟 نورت/ي 😇" -- reply 

ws[5] = "هلوو" 
rs[5] = "😻هلاوات حبي 💟 نورت/ي 😇" 

ws[6] = "هلووو" 
rs[6] = "😻هلاوات حبي 💟 نورت/ي 😇" 

ws[7] = "هاي" 
rs[7] = "😻هايات حبي 💟 نورت/ي 😇" 

ws[8] = "شغل المبردة" 
rs[8] = " تم تشغيل المبردة بنجاح ❄️" 

ws[9] = "طفي المبردة" 
rs[9] = "طفيتهه 😒🍃" 

ws[10] = "شغل السبلت" 
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[11] = "طفي السبلت" 
rs[11] = "تم تطفئة🌚🍂 السبلت بنجاح ✅" 

ws[12] = "شلونك" 
rs[12] = "🤕بلنسبة الي 🙌 واحد دايح 😅شوف الاعظاء 👲" 

ws[13] = "شونك" 
rs[13] = "🤕بلنسبة الي 🙌 واحد دايح 😅شوف الاعظاء 👲" 

ws[14] = "اشلونك" 
rs[14] = "🤕بلنسبة الي 🙌 واحد دايح 😅شوف الاعظاء 👲" 

ws[15] = "شلونج" 
rs[15] = "🙌اني زازا😻 مو بنية 😾" 

ws[16] = "شلونكم" 
rs[16] = "🤕بلنسبة الي 🙌 واحد دايح 😅شوف الاعظاء 👲" 

ws[17] = "دوم" 
rs[17] = "🤕دوم نبضك 😻" 

ws[18] = "دووم" 
rs[18] = "🤕دوم نبضك 😻" 

ws[19] = "فديتك" 
rs[19] = "🌝🍃فداك الكون🌏 حبي😻" 

ws[20] = "فديتج" 
rs[20] = "🌝🍃فداك الكون🌏 حبي😻" 

ws[21] = "فدوة" 
rs[21] = "🌝🍃فداك الكون🌏 حبي😻" 

ws[22] = "باي" 
rs[22] = "✋🏽لتروح كبد عمري😿 بدونك ما اعيش 😫💔" 

ws[23] = "بيباي" 
rs[23] = "✋🏽لتروح كبد عمري😿 بدونك ما اعيش 😫💔" 

ws[24] = "جاو" 
rs[24] = "✋🏽لتروح كبد عمري😿 بدونك ما اعيش 😫💔" 

ws[25] = "راح اروح" 
rs[25] = "✋🏽لتروح كبد عمري😿 بدونك ما اعيش 😫💔" 

ws[26] = "زازا" 
rs[26] = "ها يعيون😳 وسنونه🤓 ونبضة 😻 لزازا  كول 🍂" 

ws[27] = "زازا شلونك" 
rs[27] =  "😒ضايج اريد كبل ☹️🍂" 

ws[28] = "زازا شبيك" 
rs[28] = "🌚🍂بية حسرة وقهر 😫مال باجة🐮 لفاتتني ما اكلتها😋" 

ws[29] = "زازا انجب" 
rs[29] = "🙄من بعدك مظغوط 🙊" 

ws[30] = "زازا اسكت" 
rs[30] = "😔مو بيدي✋🏽 اذا ما احجي😹 اموت ☹️" 

ws[31] = "زازا تحبني" 
rs[31] = "🙂🍂ما احبك بس اموت عليك 😘" 

ws[32] = "زازا بوسني" 
rs[32] = "مْمْمْمْ💋ممْمْمْمْمْمْوا💋ح  يا بعد روحي تدلل😍" 

ws[33] = "بوسني" 
rs[33] = "امْمْمْمْ💋ممْمْمْمْمْمْوا💋ح اتحي 😱" 

ws[34] = "اريد بوسة" 
rs[34] = "😳عيب ولك😨 ما انطي ☹️ " 

ws[35] = "زازا امداك" 
rs[35] = "👐أأمًـًـً👐🙌👐ــًدآآآك/ج👐 نـỲǑŲـْت/ي 😡️" 

ws[37] = "شكد" 
rs[37] = "🤔اكثر من ما تتصور😍❤️️" 

ws[38] = "زازا جوعان" 
rs[38] = "👮 حاظر تاج راسي 🍴حسويلك دجاج 🐔🍤" 

ws[39] = "زازا نعسان" 
rs[39] = "😠انته نعسان اني شكو🐼متولي تنام اثول🤕😴" 

ws[40] = "زازا تحب منو" 
rs[40] = "👸خالتك/ج لشكرة 😹🙌🏽" 

ws[41] = "زازا شدسوي" 
rs[41] = "👾 دا اهكر البنك 💰 السرائيلي👻🍀" 

ws[42] = "زازا شتحب" 
rs[42] = "🙄 خالتك الشكرة 😹🙌🏽" 

ws[43] = "زازا ولي" 
rs[43] = "😼🍁ولي لتولك اثول لتغلط 😐👌🏾" 

ws[44] = "زازا شصار" 
rs[44] = "🤔مريم حبلت وجابت🚼 ونورة تعاركت وية حبيبها 🚺ومحمد زعل وراح🆔 لان محد يسولف بلكروب و…… . " 

ws[45] = "حيدر العبادي" 
rs[45] = "🚹 تروح فدة لطولة 😹" 

ws[46] = "شكو" 
rs[46] = "🚑لتدخل نفسك حشري 😂👊🏽" 

ws[47] = "انته انجب" 
rs[47] = "📱طن سكتو هههه ✈️😹" 

ws[48] = "غيث" 
rs[48] = "😍هذا الحب مالتي🙊 شتريد منه تعال ع معرفة 😻👈🏾 @Alizx12" 

ws[49] = "منير" 
rs[49] = "😴 منير مشغول اشتركو بلقناه ماتة 😎 @wounds1 شوكت ميصير مجال🐼 يرد عليكم 🙃🍃" 

ws[50] = "احبك" 
rs[50] = "😠بدت رحمة الله وبدة الزحف🚼 الة نحركم 📛يلا نخلص منكم🐍" 

ws[51] = "احبج" 
rs[51] = "😠بدت رحمة الله وبدة الزحف🚼 الة نحركم 📛يلا نخلص منكم🐍" 

ws[52] = "زازا موجود" 
rs[52] = " 😒لتخاف زازا ميروح😂ابقة علة على كلبكم 😝👌🏾️" 

ws[53] = "زازا تخليني" 
rs[53] = "🙈اخليك واخلي ابوك 🙀بس ورة 12 😻يفرغ لبيت🔞" 

ws[54] = "تخليني" 
rs[54] = " 🙈اخليك واخلي ابوك 🙀بس ورة 12 😻يفرغ لبيت🔞" 

ws[55] = "زازا واكف" 
rs[55] = "👻🙌🏽لجداب الله يذبة بلنار 📛😹" 

ws[56] = "زازا اقرالي دعاء" 
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂" 

ws[57] = "زازا عطشان" 
rs[57] = "😠زازا ما عندة بير زمزم 💦ولي 😒👟" 

ws[58] = "زازا الزاحف" 
rs[58] = "🐍زاحف ع خالتك 👸دخلوني اكبل وثول 🚶🍃" 

ws[59] = "" 
rs[59] = "" 

ws[60] = "😒" 
rs[60] = "🙊اباوعلك بحقد😠 ومن داخلي😻 اتمناك🙃🍂" 

ws[61] = "" 
rs[61] = "" 

ws[62] = "" 
rs[62] = "" 

ws[63] = "" 
rs[63] = "" 

ws[64] = "" 
rs[64] = "" 

ws[65] = "" 
rs[65] = "" 

ws[66] = "" 
rs[66] = "" 

ws[67] = "" 
rs[67] = "" 

ws[68] = "" 
rs[68] = "" 

ws[69] = "" 
rs[69] = "" 

ws[70] = "" 
rs[70] = "" 

ws[71] = "" 
rs[71] = "" 

ws[72] = "" 
rs[72] = "" 

ws[73] = "" 
rs[73] = "" 

ws[74] = "" 
rs[74] = "" 

ws[75] = "" 
rs[75] = "" 

ws[76] = "" 
rs[76] = "" 

ws[78] = "" 
rs[78] = "" 

ws[79] = "" 
rs[79] = "" 

ws[80] = "" 
rs[80] = "" 

ws[81] = "" 
rs[81] = "" 

ws[83] = "" 
rs[83] = "" 

ws[84] = "" 
rs[84] = "" 

ws[85] = "" 
rs[85] = "" 

ws[86] = "" 
rs[86] = "" 

ws[87] = "" 
rs[87] = "" 

ws[88] = "️" 
rs[88] = "" 

ws[89] = "غادر" 
rs[89] = "😠مو صوجكم صوج ليحميكم 😒 حاظر ✋🏾مطوري باي🏃🏼🚀" 

ws[90] = "" 
rs[90] = "ا" 

ws[92] = "" 
rs[92] = "" 

ws[93] = "" 
rs[93] = "" 

ws[94] = "حروح اسبح" 
rs[94] = " واخيراً 😂" 

ws[95] = "حروح اغسل" 
rs[95] = " واخيراً 😂" 

ws[96] = "حروح اطب للحمام" 
rs[96] = " واخيراً 😂" 

ws[97] = "" 
rs[97] = "" 

ws[98] = "" 
rs[98] = "" 

ws[99] = "البوت عاوي" 
rs[99] = "" 

ws[100] = "" 
rs[100] = "" 

ws[101] = "" 
rs[101] = "" 

ws[102] = "" 
rs[102] = "  " 

ws[103] = "" 
rs[103] = "" 

ws[104] = "" 
rs[104] = "" 

ws[105] = "اذن المغرب" 
rs[105] = "استحرم 🌚🍃" 

ws[106] = "حلو" 
rs[106] = "🙃🍃 #كلشي_حلو_بوجودك 🚀" 

ws[107] = "" 
rs[107] = " " 

ws[108] = "" 
rs[108] = "" 

ws[109] = "" 
rs[109] = " " 

ws[110] = "" 
rs[110] = "" 

ws[111] = "" 
rs[111] = "" 

ws[112] = "" 
rs[112] = "" 

ws[113] = "" 
rs[113] = "" 

ws[114] = "" 
rs[114] = "" 

ws[115] = "" 
rs[115] = "" 

ws[116] = "" 
rs[116] = "" 

ws[117] = "" 
rs[117] = "" 

ws[118] = "" 
rs[118] = "" 

ws[119] = "" 
rs[119] = "" 

ws[120] = "" 
rs[120] = "" 

ws[121] = "" 
rs[121] = "" 

ws[122] = "" 
rs[122] = "" 

ws[123] = "" 
rs[123] = "" 

ws[124] = "" 
rs[124] = "" 

ws[125] = "" 
rs[125] = "خير 🌝" 

ws[126] = "" 
rs[126] = "" 

ws[127] = "ليش" 
rs[127] = "تاكل خرة الجيش 😂😂" 

ws[128] = "طاسه" 
rs[128] = "امك حلوة ورقاصه 💃🏻" 

ws[129] = "عشرين" 
rs[129] = "تاكل جدر خنين 😫" 

ws[130] = "ميه" 
rs[130] = "😂تشرب مميه" 

ws[131] = "اربعة" 
rs[131] = "😂لحيه ابوك مربعه" 

ws[132] = "فارة" 
rs[132] = "😂دفترك كله صفارة" 

ws[133] = "ميتين" 
rs[133] = "😂فوك راسك قندرتين" 

ws[134] = "مات" 
rs[134] = "ابو الحمامات 🐦" 

ws[135] = "توفه" 
rs[135] = "ابو اللفه 🌯" 

ws[136] = "احترك" 
rs[136] = "🍾البو العرك" 

ws[137] = "غرك" 
rs[137] = "ابو العرك 🍾" 

ws[138] = "طار" 
rs[138] = "ابن الطيار" 

ws[139] = "" 
rs[139] = "" 

ws[140] = "" 
rs[140] = "" 

ws[141] = "" 
rs[141] = " " 

ws[142] = "" 
rs[142] = "" 

ws[143] = "" 
rs[143] = "" 

ws[144] = "" 
rs[144] = "" 

ws[145] = "" 
rs[145] = "" 

ws[146] = "" 
rs[146] = "" 

ws[147] = "" 
rs[147] = "" 

ws[148] = "" 
rs[148] = "" 

ws[149] = "" 
rs[149] = "" 

ws[150] = "" 
rs[150] = "" 

ws[151] = "منو اني" 
rs[151] = "انته احلى شي بحياتي ❤️🍃" 

ws[152] = "" 
rs[152] = "" 

ws[153] = "" 
rs[153] = "" 

ws[154] = "" 
rs[154] = "" 

ws[155] = "" 
rs[155] = "" 

ws[156] = "" 
rs[156] = "" 

ws[157] = "" 
rs[157] = "" 

ws[158] = "" 
rs[158] = "" 

ws[159] = "" 
rs[159] = "" 

ws[160] = "" 
rs[160] = "" 

ws[161] = "" 
rs[161] = " " 

ws[162] = "" 
rs[162] = "" 

ws[163] = "" 
rs[163] = " " 

ws[164] = "" 
rs[164] = "" 

ws[165] = "" 
rs[165] = "" 

ws[166] = "" 
rs[166] = " " 

ws[167] = "" 
rs[167] = "" 

ws[168] = "مساؤؤ" 
rs[168] = "🚁 #مسائو_يعمري_انته_ي 🎀" 

ws[169] = "مساء الخير" 
rs[169] = "🚁 #مسائو_يعمري_انته_ي 🎀" 

ws[170] = "صباحوو" 
rs[170] = "🚁 #صَبَاحَ_النور 🎀" 

ws[171] = "صباح لخير" 
rs[171] = "🚁 #صَبَاحَ_النور 🎀" 

ws[172] = "صباح الخير" 
rs[172] = "🚁 #صَبَاحَ_النور 🎀" 

ws[173] = "لتغلط" 
rs[173] = "😸🙌🏽اوك بعد ما اهينك 🙊🌵" 

ws[174] = "زازا اتفل على هذا" 
rs[174] = "😹خــ💦ـتـــ💦ــفـــ💦ـــو💦ـو💦ـو كافي لو بعد اكثر 🤓🙌🏽" 

ws[175] = "زازا اتفل" 
rs[175] = "😹خــ💦ـتـــ💦ــفـــ💦ـــو💦ـو💦ـو كافي لو بعد اكثر 🤓🙌🏽" 

ws[176] = "اتفل" 
rs[176] = "خخخخخنفووووو💦💦💦💦💦💦💦💦💦💦" 

ws[177] = "" 
rs[177] = "" 

ws[178] = "😳" 
rs[178] = "❌لـŃØـ😌✋ـ✿ـا❌ تصدم ڪفشةة. ْْعمري. هية.  ✾ هٌـஆــٌُأإي  ٱٳلدنيه👻 " 

ws[179] = "شغال" 
rs[179] = " 🌐 يب شغال شغال 🎃🍂" 

ws[180] = "لبوت واكف" 
rs[180] = "❌لا شغال 🚓 لتجذب 😒" 

ws[181] = "البوت واكف" 
rs[181] = "❌لا شغال 🚓 لتجذب 😒" 

ws[182] = "اجيت" 
rs[182] = " 😐لا هلا 🗿 قصدي نورت/ي ☺️🎯" 

ws[183] = "شكو ماكو" 
rs[183] = "😻غيرك بلگلب💟 ماكو ⛔️" 

ws[184] = "help" 
rs[184] = "Ⓜ️ اكتب (الاوامر)  لرؤية الاوامر ✅" 

ws[185] = "مساعدة" 
rs[185] = "Ⓜ️ اكتب (الاوامر)  لرؤية الاوامر ✅" 

ws[186] = "مرحبا" 
rs[186] = " 🃏 #مراحب_نورت_ي 🚀" 

ws[187] = "اريد اغير جو" 
rs[187] = "😂 تغير جو لو تسحف 🐍 عل بنات" 

ws[188] = "السلام" 
rs[188] = "🈂 #وعـَلـْيگمّ_السَلٱمٌ 💟" 

ws[189] = "السلام عليكم" 
rs[189] = "🈂 #وعـَلـْيگمّ_السَلٱمٌ 💟" 

ws[190] = "سلام" 
rs[190] = "🈂 #وعـَلـْيگمّ_السَلٱمٌ 💟" 

ws[191] = "سلام عليكم" 
rs[191] = "🈂 #وعـَلـْيگمّ_السَلٱمٌ 💟" 

-- the main function 
function run( msg, matches ) 
-- just a local variables that i used in my algorithm 
local i = 0; local w = false 

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do 
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
i = k; w = true; 
end 
end 

-- check if { w } is not false and { i } not equals to 0 
if ( (w ~= false) and (i ~= 0) ) then 
-- get the receiver :3 
R = get_receiver(msg) 
-- send him the proper message from the index that { i } assigned to 
--send_large_msg ( R , rs[i] ); 
--send_reply(msg.id, rs[i]) 
reply_msg(msg.id, rs[i], ok_cb, false ) 
end 

-- don't edit this section 
if ( msg.text == "about" ) then 
if ( msg.from.username == "kaastro" ) then 
R = get_receiver(msg) 
send_large_msg ( R , "Made by @kaastro" ); 
end 
end 

end 

return { 
patterns = { 
"(.*)" 
}, 
run = run 
} 

end 
